Catalogs/ЛБ_ДрагоценныеКамни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ДрагоценныеКамни</Name>
			<Comment>Виды драгоценных камней</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКамня</Name>
					<Comment>Вид камня</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКамней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Comment>Краткое наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеКлассификатораГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКодированияГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОценивается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаДопустимыхФормОгранки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаДопустимыхФормОгранки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОграниченныйСписокВидовОгранки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаДопустимыхКачествОгранки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаДопустимыхКачествОгранки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КачествоОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаДопустимыхВидовОгранки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаДопустимыхВидовОгранки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаВеса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СпособыРасчетаВесаДрагоценныхКамней</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОграниченныйСписокВидовОгранки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПараметрыОценкиВставокВОбъектахЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПараметрыОценкиВставокВОбъектахЗалога</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оценивается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыКамней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКамней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Драгоценные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полудрагоценные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Синтетические</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_ДрагоценныеКамни/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьОтборыРегистров()
	Отбор = НастройкаВыбораФормОгранки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКамня");
    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.Использование  = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
    Отбор.ПравоеЗначение = Объект.Ссылка;
	
	Отбор = НастройкаВыбораКачестваОгранки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКамня");
    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.Использование  = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
    Отбор.ПравоеЗначение = Объект.Ссылка;		                               

    Отбор = НастройкаОграниченияВыбораВидовОгранки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКамня");
    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.Использование  = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
    Отбор.ПравоеЗначение = Объект.Ссылка;  
	
	Отбор = ПараметрыОенкиВставок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКамня");
    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.Использование  = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
    Отбор.ПравоеЗначение = Объект.Ссылка;
 КонецПроцедуры
   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВидКамня = Перечисления.ЛБ_ВидыКамней.Драгоценные;  
	КонецЕсли;	
	ЗаполнитьОтборыРегистров(); 
	УстановитьВидимость();
КонецПроцедуры    

&НаСервере
Процедура УстановитьВидимость()
	Если НЕ Объект.Ссылка = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант Тогда
		Элементы.Страница1.Видимость =ложь; 
		Элементы.Страница2.Видимость =ложь;
	КонецЕсли;	
	Если Объект.НеОценивается Тогда  
		Элементы.СтраницаЗ.Видимость =ложь;
	Иначе	
		Элементы.СтраницаЗ.Видимость =Истина;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьНастройкуФО(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника");
		Возврат;
	КонецЕсли;
	Параметрыформы = новый структура;
	Параметрыформы.Вставить("ВидКамня", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ЛБ_НастройкаДопустимыхФормОгранки.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуКО(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника");
		Возврат;
	КонецЕсли;
	Параметрыформы = новый структура;
	Параметрыформы.Вставить("ВидКамня", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ЛБ_НастройкаДопустимыхКачествОгранки.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуВО(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника");
		Возврат;
	КонецЕсли;
	Параметрыформы = новый структура;
	Параметрыформы.Вставить("ВидКамня", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ЛБ_НастройкаДопустимыхВидовОгранки.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПараметрыОценки(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника");
		Возврат;
	КонецЕсли;
	Параметрыформы = новый структура;
	Параметрыформы.Вставить("ВидКамня", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ЛБ_ПараметрыОценкиВставокВОбъектахЗалога.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НеОцениваетсяПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
